Revit 2027 API
IExtension Interface
An interface that supports the additional operation for Extension Status
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IExtension
Public Interface IExtension
public interface class IExtension
type IExtension = interface end
The IExtension type exposes the following members.
Properties
Name | Description
Extended | Retrieves or set the extension status at the end
HasMiter | Retrieves the miter status at the end
IsMiterLocked | Retrieves or set the miter locked status at the end.
SymbolicExtended | Retrieves or set the symbolic extension status at the end
Top
See Also
Reference
Autodesk.Revit.DB Namespace